{
  "backend/main.mo": "Defines game and player stats types, stores last five games in maps, and exposes methods to store and retrieve game data.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files related to player stats, props, and UI components.",
  "frontend/index.css": "Tailwind CSS setup defining global styles and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing player selection, data ingestion, offered props, and displaying recommendations.",
  "frontend/src/features/playerProps/backendClient.ts": "Client class that fetches stored last five games from the backend and converts them to frontend input format.",
  "frontend/src/features/playerProps/components/LastFiveGamesForm.tsx": "Form for entering a player name, validating it, fetching last five games, and showing results or errors.",
  "frontend/src/features/playerProps/components/OfferedPropsEditor.tsx": "Sidebar UI for choosing a sportsbook and adding or removing offered prop lines used to filter recommendations.",
  "frontend/src/features/playerProps/components/RecommendationsList.tsx": "UI component rendering prop recommendations with loading, error, and filtering states.",
  "frontend/src/features/playerProps/hooks/useIngestLastFiveGamesMutation.ts": "Mutation that fetches a player's last 5 games from BallDontLie API, converts them, and stores them in the backend.",
  "frontend/src/features/playerProps/hooks/useLastFiveGamesQuery.ts": "Query hook that retrieves a player's last five games from the backend actor.",
  "frontend/src/features/playerProps/hooks/usePlayerStatsMutation.ts": "Empty file placeholder for a mutation hook.",
  "frontend/src/features/playerProps/hooks/usePropRecommendationsQuery.ts": "Query hook that computes and optionally filters prop recommendations based on recent game stats.",
  "frontend/src/features/playerProps/types.ts": "Type definitions for game stats, offered props, and prop recommendations.",
  "frontend/src/features/playerProps/utils/propMatching.ts": "Helpers for normalizing prop types, matching recommendations to offered props, and formatting labels.",
  "frontend/src/features/playerProps/validation.ts": "Validation utilities for player names and game stat inputs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and identity loading across the app.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended colors, typography, container queries, animations, and custom theme settings.",
  "project_state.json": "Defines the project’s current state, goals, architecture notes, known issues, and existing features for an automated player-stats ingestion and recommendation system."
}